{
    "projects": [
        {
            "name": "ArgentBank",
            "image": "./p11-bank-home.webp",
            "url": "https://github.com/H9791/ArgentBank",
            "description": "Project ArgentBank implements front-end for a banking website. Integrates functions like user authentification and transaction display, and uses React and Redux Toolkit for state management."
        },
        {
            "name": "Agence immobiliere",
            "image": "./kasa-banner.webp",
            "url": "https://github.com/H9791/Kasa",
            "description": "Project Kasa is a front-end for a real estate agency that rents properties for short or long term accomodation. KASA is a complete rewrite of a website that was previously implemented in ASP.NET. This updated version is build with React."
        },
        {
            "name": "Sophie Bluel",
            "image": "./p6-sophiebluel.webp",
            "url": "https://github.com/H9791/P6-Frontend-Sophie-Bluel/",
            "description": "Project Sophie Bluel consisted of debugging of a pre-existing website, to ensure correct presentation and dynamic behaviour like sorting and image sliding. Website is coded in React. "
        },
        {
            "name": "OhMyFood",
            "image": "./p4-ohmyfood.webp",
            "url": "https://github.com/H9791/OhMyFood/",
            "description": "Project OhMyFood is a mobile-first website that lists menus of gourmet restaurants. Includes reservation system and possibility to compose your menu ahead of restaurant visit. Website is built with HTML and CSS and shows various front-end animations. "
        },
        {
            "name": "Booki",
            "image": "./p3-booki-portf.webp",
            "url": "https://github.com/H9791/P3-Booki",
            "description": "Project Booki consisted of coding frontend for travel agency using HTML and CSS. Website shows many elements that scale and move, depending on the screen resolution. The site is responsive in every aspect and implements complex HTML and CSS."
        },
        {
            "name": "Print It!",
            "image": "./p5-printit.webp",
            "url": "https://github.com/H9791/Print_It",
            "description": "Project Print It! consisted of implementing a dynamic element in form of a slider of images in the website header. Uses HTML, CSS and Javascript for the slider."
        }
    ],
    "skills": [
        {
            "name": "React",
            "image": "./React-icon.svg"
        },
        {
            "name": "Redux",
            "image": "./redux_logo.jpg"
        },
        {
            "name": "TypeScript",
            "image": "./ts-logo-128.svg"
        },
        {
            "name": "JavaScript",
            "image": "./JavaScript_logo.svg"
        },
        {
            "name": "MongoDB",
            "image": "./mongo.jpg"
        },
        {
            "name": "CSharp",
            "image": "./csharp_logo.jpg"
        },
        {
            "name": "HTML",
            "image": "./HTML5_logo.svg"
        },
        {
            "name": "CSS",
            "image": "./CSS3_logo.svg"
        },
        {
            "name": "SASS",
            "image": "./sass.jpg"
        },
        {
            "name": "Git",
            "image": "./git-logo.jpg"
        },
        {
            "name": "NPM",
            "image": "./npm-logo.jpg"
        },
        {
            "name": "Api Rest",
            "image": "./restapi-logo.jpg"
        },
        {
            "name": "Figma",
            "image": "./figma-logo.jpg"
        },
        {
            "name": "KANBAN",
            "image": "./kanban-logo.jpg"
        },
        {
            "name": "SCRUM",
            "image": "./scrum-logo.jpg"
        },
        {
            "name": "Swagger",
            "image": "./swagger-logo.jpg"
        }
    ],
    "skills_text": [
        "Install a front-end development environment",
        "Integrate content according to a template using HTML and CSS",
        "Implement a responsive interface with HTML and CSS",
        "Develop a web interface with Sass",
        "Implementing CSS animations",
        "Version your project with Git and Github",
        "Manipulating DOM elements with JavaScript",
        "Retrieving user data in JavaScript via forms",
        "Managing user events with JavaScript",
        "Monitor project progress using a project management tool",
        "Present a technical solution",
        "Break down functionalities into tasks to prepare for development",
        "Implement a technology watch method",
        "Write technical specifications for a web project based on functional requirements",
        "Develop website interface elements using React components",
        "Initialize an application with Create React App",
        "Configure navigation between application pages with React Router",
        "Optimizing website performance with Google Rich Snippet, Wave and Lighthouse extension",
        "SEARCH ENGINE OPTIMIZATION (SEO)",
        "ACCESSIBILITY OPTIMIZATION",
        "Debugging a website with Chrome DevTools",
        "Displaying back-end data on the interface via API calls",
        "Configure API routes for client/server communication",
        "Implement data management with Redux to ensure front-end operation",
        "Deploying a static site online"
    ],
    "me_description": [
        "I am a passionate software engineer that specializes in developing modern, responsive and SEO optimized websites with React and Typescript. Currently based in France I am looking for exciting opportunities in my home country or with foreign companies. I have successfully completed an associate's degree in the field of web development in France. This practical training consisted of coding 12 projects of increasing complexity and allowed me to obtain solid skills in core technologies for web development, e.g. HTML, CSS, JavaScript, Typescript, React, Redux and others."
    ],
    "me_contact": {
        "tlf": "+33 123456789",
        "email": "jan.gren[at]mymail.com"
    }
}